Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_i2c.c
/****************************************************************************
 * vendor/espressif/chips/esp32p4/esp32p4_i2c.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * ESP32-P4 I2C Bus Driver
 *
 * This driver implements the NuttX i2c_master_s interface for the ESP32-P4
 * HP I2C peripherals (I2C0 and I2C1).  The implementation uses the
 * hardware command-based interface with polling for simplicity and
 * reliability.
 *
 * Key features:
 *   - I2C master mode only
 *   - Standard mode (100 kHz) and Fast mode (400 kHz) support
 *   - GPIO matrix pin routing for SCL/SDA signals
 *   - Polling-based transfer (no interrupt overhead)
 *   - Timeout detection for bus hang recovery
 *   - Multi-message transfer with repeated start support
 *
 * ESP-IDF reference:
 *   - examples/peripherals/i2c/i2c_basic
 *   - components/esp_driver_i2c/i2c_master.c
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/i2c/i2c_master.h>

#include "hardware/esp32p4_i2c.h"
#include "hardware/esp32p4_gpio.h"
#include "hardware/esp32p4_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* I2C timeout in busy-wait iterations.
 * At 80 MHz APB clock, 100000 iterations is ~12.5ms.
 */

#define I2C_TIMEOUT_COUNT           100000

/* Default I2C pins if not configured via Kconfig */

#ifndef CONFIG_ESP32P4_I2C0_SCL_GPIO
#  define CONFIG_ESP32P4_I2C0_SCL_GPIO  8
#endif

#ifndef CONFIG_ESP32P4_I2C0_SDA_GPIO
#  define CONFIG_ESP32P4_I2C0_SDA_GPIO  9
#endif

#ifndef CONFIG_ESP32P4_I2C1_SCL_GPIO
#  define CONFIG_ESP32P4_I2C1_SCL_GPIO  10
#endif

#ifndef CONFIG_ESP32P4_I2C1_SDA_GPIO
#  define CONFIG_ESP32P4_I2C1_SDA_GPIO  11
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* I2C bus private data structure */

struct esp32p4_i2c_priv_s
{
  const struct i2c_ops_s *ops;    /* Standard I2C operations (must be first) */
  uint32_t                base;   /* I2C register base address */
  int                     irq;    /* Interrupt number */
  uint32_t                freq;   /* Current I2C frequency */
  uint8_t                 scl_sig; /* GPIO matrix SCL signal */
  uint8_t                 sda_sig; /* GPIO matrix SDA signal */
  uint8_t                 scl_gpio; /* SCL GPIO pin */
  uint8_t                 sda_gpio; /* SDA GPIO pin */
  mutex_t                 lock;   /* Mutual exclusion mutex */
  int                     refs;   /* Reference count */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int  esp32p4_i2c_transfer(FAR struct i2c_master_s *dev,
                                 FAR struct i2c_msg_s *msgs, int count);
static int  esp32p4_i2c_reset(FAR struct i2c_master_s *dev);
static int  esp32p4_i2c_setup(FAR struct i2c_master_s *dev);
static int  esp32p4_i2c_shutdown(FAR struct i2c_master_s *dev);

/* Internal helper functions */

static void esp32p4_i2c_config_gpio(struct esp32p4_i2c_priv_s *priv);
static void esp32p4_i2c_set_clock(struct esp32p4_i2c_priv_s *priv,
                                  uint32_t freq);
static int  esp32p4_i2c_write_cmd(struct esp32p4_i2c_priv_s *priv,
                                  uint8_t cmd_idx, uint8_t op_code,
                                  uint8_t byte_num, bool ack_check,
                                  bool ack_exp, bool ack_val);
static int  esp32p4_i2c_poll_cmd_done(struct esp32p4_i2c_priv_s *priv,
                                      uint8_t cmd_idx);
static int  esp32p4_i2c_wait_bus_idle(struct esp32p4_i2c_priv_s *priv);
static int  esp32p4_i2c_poll_trans_done(struct esp32p4_i2c_priv_s *priv);
static void esp32p4_i2c_reset_fifo(struct esp32p4_i2c_priv_s *priv);

/* Transfer helpers */

static int  esp32p4_i2c_write_bytes(struct esp32p4_i2c_priv_s *priv,
                                    FAR const uint8_t *data, uint8_t len,
                                    bool ack_check, bool last);
static int  esp32p4_i2c_read_bytes(struct esp32p4_i2c_priv_s *priv,
                                   FAR uint8_t *data, uint8_t len,
                                   bool send_nack);
static int  esp32p4_i2c_do_write(struct esp32p4_i2c_priv_s *priv,
                                 FAR struct i2c_msg_s *msg);
static int  esp32p4_i2c_do_read(struct esp32p4_i2c_priv_s *priv,
                                FAR struct i2c_msg_s *msg);
static int  esp32p4_i2c_do_writeread(struct esp32p4_i2c_priv_s *priv,
                                     FAR struct i2c_msg_s *wmsg,
                                     FAR struct i2c_msg_s *rmsg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I2C0 instance */

#ifdef CONFIG_ESP32P4_I2C0
static const struct i2c_ops_s g_i2c0_ops =
{
  .transfer = esp32p4_i2c_transfer,
#ifdef CONFIG_I2C_RESET
  .reset    = esp32p4_i2c_reset,
#endif
  .setup    = esp32p4_i2c_setup,
  .shutdown = esp32p4_i2c_shutdown,
};

