Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_i2c.c
static struct esp32p4_i2c_priv_s g_i2c0_priv =
{
  .ops      = &g_i2c0_ops,
  .base     = I2C0_BASE,
  .irq      = ESP32P4_IRQ_I2C0,
  .freq     = I2C_SPEED_STANDARD,
  .scl_sig  = I2C0_SCL_OUT_SIG,
  .sda_sig  = I2C0_SDA_OUT_SIG,
  .scl_gpio = CONFIG_ESP32P4_I2C0_SCL_GPIO,
  .sda_gpio = CONFIG_ESP32P4_I2C0_SDA_GPIO,
  .lock     = NXMUTEX_INITIALIZER,
  .refs     = 0,
};
#endif /* CONFIG_ESP32P4_I2C0 */

/* I2C1 instance */

#ifdef CONFIG_ESP32P4_I2C1
static const struct i2c_ops_s g_i2c1_ops =
{
  .transfer = esp32p4_i2c_transfer,
#ifdef CONFIG_I2C_RESET
  .reset    = esp32p4_i2c_reset,
#endif
  .setup    = esp32p4_i2c_setup,
  .shutdown = esp32p4_i2c_shutdown,
};

static struct esp32p4_i2c_priv_s g_i2c1_priv =
{
  .ops      = &g_i2c1_ops,
  .base     = I2C1_BASE,
  .irq      = ESP32P4_IRQ_I2C1,
  .freq     = I2C_SPEED_STANDARD,
  .scl_sig  = I2C1_SCL_OUT_SIG,
  .sda_sig  = I2C1_SDA_OUT_SIG,
  .scl_gpio = CONFIG_ESP32P4_I2C1_SCL_GPIO,
  .sda_gpio = CONFIG_ESP32P4_I2C1_SDA_GPIO,
  .lock     = NXMUTEX_INITIALIZER,
  .refs     = 0,
};
#endif /* CONFIG_ESP32P4_I2C1 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_i2c_config_gpio
 *
 * Description:
 *   Configure GPIO pins for I2C SCL and SDA via the GPIO matrix.
 *
 *   The ESP32-P4 uses a GPIO matrix that allows any peripheral signal
 *   to be routed to any GPIO pin.  This function sets up the pin mux
 *   for the I2C SCL and SDA signals.
 *
 *   Both SCL and SDA are configured as open-drain outputs with pull-up
 *   enabled, which is the standard I2C bus configuration.
 *
 ****************************************************************************/

static void esp32p4_i2c_config_gpio(struct esp32p4_i2c_priv_s *priv)
{
  uint32_t regval;

  /* Configure SCL pin:
   * - Route I2C SCL output signal to GPIO via GPIO matrix
   * - Configure as open-drain output with pull-up
   */

  regval = priv->scl_sig & GPIO_FUNC_OUT_SEL_M;
  REG_WRITE(GPIO_FUNC_OUT_SEL_CFG_REG(priv->scl_gpio), regval);

  /* Configure SDA pin:
   * - Route I2C SDA output signal to GPIO via GPIO matrix
   * - Configure as open-drain output with pull-up
   */

  regval = priv->sda_sig & GPIO_FUNC_OUT_SEL_M;
  REG_WRITE(GPIO_FUNC_OUT_SEL_CFG_REG(priv->sda_gpio), regval);

  /* Configure SCL input routing:
   * Route the GPIO pin to the I2C SCL input signal.
   */

  regval = priv->scl_gpio & 0x3f;
  REG_WRITE(GPIO_FUNC_IN_SEL_CFG_REG(priv->scl_sig), regval);

  /* Configure SDA input routing:
   * Route the GPIO pin to the I2C SDA input signal.
   */

  regval = priv->sda_gpio & 0x3f;
  REG_WRITE(GPIO_FUNC_IN_SEL_CFG_REG(priv->sda_sig), regval);

  /* Configure SCL pin: open-drain with pull-up, input enabled */

  regval = IO_MUX_GPIO_FUNC << IO_MUX_MCU_SEL_S;
  regval |= IO_MUX_FUN_WPU;     /* Pull-up */
  regval |= IO_MUX_FUN_IE;      /* Input enable */
  regval |= (2 << IO_MUX_FUN_DRV_S); /* Drive strength 2 */
  REG_WRITE(IO_MUX_GPIO_REG(priv->scl_gpio), regval);

  /* Configure SDA pin: open-drain with pull-up, input enabled */

  regval = IO_MUX_GPIO_FUNC << IO_MUX_MCU_SEL_S;
  regval |= IO_MUX_FUN_WPU;     /* Pull-up */
  regval |= IO_MUX_FUN_IE;      /* Input enable */
  regval |= (2 << IO_MUX_FUN_DRV_S); /* Drive strength 2 */
  REG_WRITE(IO_MUX_GPIO_REG(priv->sda_gpio), regval);

  /* Enable open-drain mode for both pins */

  REG_SET_BIT(GPIO_PIN_REG(priv->scl_gpio), GPIO_PIN_PAD_DRIVER_BIT);
  REG_SET_BIT(GPIO_PIN_REG(priv->sda_gpio), GPIO_PIN_PAD_DRIVER_BIT);
}

/****************************************************************************
 * Name: esp32p4_i2c_set_clock
 *
 * Description:
 *   Configure the I2C clock frequency.
 *
 *   The I2C SCL frequency is determined by:
 *     SCL_FREQ = APB_CLK / (scl_high_period + scl_low_period)
 *
 *   For 100 kHz (standard mode): 80 MHz / (400 + 400) = 100 kHz
 *   For 400 kHz (fast mode):     80 MHz / (100 + 100) = 400 kHz
 *
 ****************************************************************************/

static void esp32p4_i2c_set_clock(struct esp32p4_i2c_priv_s *priv,
                                  uint32_t freq)
{
  uint32_t high_period;
  uint32_t low_period;

  /* Select timing based on requested frequency */

  if (freq >= I2C_SPEED_FAST)
    {
      high_period = I2C_SCL_HIGH_PERIOD_400K;
      low_period  = I2C_SCL_LOW_PERIOD_400K;
    }
  else
    {
      high_period = I2C_SCL_HIGH_PERIOD_100K;
      low_period  = I2C_SCL_LOW_PERIOD_100K;
    }

  /* Set SCL high period */

  REG_WRITE(priv->base + I2C_SCL_HIGH_PERIOD_REG,
            (high_period & 0x1ff) |
            ((high_period & 0x1ff) << 8));  /* wait_high_period */

  /* Set SCL low period */

  REG_WRITE(priv->base + I2C_SCL_LOW_PERIOD_REG,
            low_period & 0x1ff);

  /* Set SDA hold time */

  REG_WRITE(priv->base + I2C_SDA_HOLD_REG,
            I2C_SDA_HOLD_TIME & 0x1ff);

  /* Set SDA sample time */

  REG_WRITE(priv->base + I2C_SDA_SAMPLE_REG,
            I2C_SDA_SAMPLE_TIME & 0x1ff);

  /* Set start/stop timing */

  REG_WRITE(priv->base + I2C_SCL_START_HOLD_REG,
            I2C_SCL_START_HOLD_TIME & 0x1ff);
  REG_WRITE(priv->base + I2C_SCL_RSTART_SETUP_REG,
            I2C_SCL_RSTART_SETUP_TIME & 0x1ff);
  REG_WRITE(priv->base + I2C_SCL_STOP_HOLD_REG,
            I2C_SCL_STOP_HOLD_TIME & 0x1ff);
  REG_WRITE(priv->base + I2C_SCL_STOP_SETUP_REG,
            I2C_SCL_STOP_SETUP_TIME & 0x1ff);

  /* Configure glitch filter */

  REG_WRITE(priv->base + I2C_FILTER_CFG_REG,
            (I2C_FILTER_CYCLES << I2C_SCL_FILTER_THRES_S) |
            (I2C_FILTER_CYCLES << I2C_SDA_FILTER_THRES_S) |
            I2C_SCL_FILTER_EN | I2C_SDA_FILTER_EN);

  /* Configure timeout */

  REG_WRITE(priv->base + I2C_TO_REG,
            (I2C_TIMEOUT_VALUE & I2C_TIME_OUT_VALUE_M) |
            I2C_TIME_OUT_EN);

  /* Update configuration */

  REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_CONF_UPGATE);

  priv->freq = freq;
}

/****************************************************************************
 * Name: esp32p4_i2c_write_cmd
 *
 * Description:
 *   Write a command to one of the 8 I2C command registers.
 *
 *   Command encoding:
 *     [2:0]   op_code (RSTART=0, WRITE=1, READ=2, STOP=3, END=4)
 *     [10:3]  byte_num (number of bytes)
 *     [11]    ack_check_en
 *     [12]    ack_exp
 *     [13]    ack_val
 *
 ****************************************************************************/

