Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_i2c.c
static int esp32p4_i2c_write_cmd(struct esp32p4_i2c_priv_s *priv,
                                 uint8_t cmd_idx, uint8_t op_code,
                                 uint8_t byte_num, bool ack_check,
                                 bool ack_exp, bool ack_val)
{
  uint32_t cmd;

  if (cmd_idx >= I2C_CMD_REG_NUM)
    {
      return -EINVAL;
    }

  cmd = (op_code & I2C_CMD_OP_CODE_M) |
        ((byte_num << I2C_CMD_BYTE_NUM_S) & I2C_CMD_BYTE_NUM_M);

  if (ack_check)
    {
      cmd |= I2C_CMD_ACK_CHECK_EN;
    }

  if (ack_exp)
    {
      cmd |= I2C_CMD_ACK_EXP;
    }

  if (ack_val)
    {
      cmd |= I2C_CMD_ACK_VAL;
    }

  REG_WRITE(priv->base + I2C_COMD_REG(cmd_idx), cmd);

  return OK;
}

/****************************************************************************
 * Name: esp32p4_i2c_poll_cmd_done
 *
 * Description:
 *   Wait for a command register to complete (cmd_done bit set).
 *
 ****************************************************************************/

static int esp32p4_i2c_poll_cmd_done(struct esp32p4_i2c_priv_s *priv,
                                     uint8_t cmd_idx)
{
  int timeout = I2C_TIMEOUT_COUNT;

  while (timeout-- > 0)
    {
      if (REG_READ(priv->base + I2C_COMD_REG(cmd_idx)) & I2C_CMD_DONE)
        {
          return OK;
        }
    }

  i2cerr("ERROR: I2C cmd%d timeout\n", cmd_idx);
  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: esp32p4_i2c_wait_bus_idle
 *
 * Description:
 *   Wait until the I2C bus is idle (not busy).
 *
 ****************************************************************************/

static int esp32p4_i2c_wait_bus_idle(struct esp32p4_i2c_priv_s *priv)
{
  int timeout = I2C_TIMEOUT_COUNT;

  while (timeout-- > 0)
    {
      if (!(REG_READ(priv->base + I2C_SR_REG) & I2C_BUS_BUSY))
        {
          return OK;
        }
    }

  i2cerr("ERROR: I2C bus busy timeout\n");
  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: esp32p4_i2c_poll_trans_done
 *
 * Description:
 *   Wait for the TRANS_COMPLETE interrupt flag, which indicates that
 *   the entire I2C transaction (including STOP) has completed.
 *
 ****************************************************************************/

static int esp32p4_i2c_poll_trans_done(struct esp32p4_i2c_priv_s *priv)
{
  int timeout = I2C_TIMEOUT_COUNT;

  while (timeout-- > 0)
    {
      if (REG_READ(priv->base + I2C_INT_RAW_REG) & I2C_TRANS_COMPLETE_INT)
        {
          /* Clear the interrupt */

          REG_WRITE(priv->base + I2C_INT_CLR_REG, I2C_TRANS_COMPLETE_INT);
          return OK;
        }
    }

  i2cerr("ERROR: I2C trans_done timeout\n");
  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: esp32p4_i2c_reset_fifo
 *
 * Description:
 *   Reset both TX and RX FIFOs.
 *
 ****************************************************************************/

static void esp32p4_i2c_reset_fifo(struct esp32p4_i2c_priv_s *priv)
{
  REG_SET_BIT(priv->base + I2C_FIFO_CONF_REG,
              I2C_RX_FIFO_RST | I2C_TX_FIFO_RST);
}

/****************************************************************************
 * Name: esp32p4_i2c_write_bytes
 *
 * Description:
 *   Write bytes to the I2C TX FIFO and execute the WRITE command.
 *
 ****************************************************************************/

static int esp32p4_i2c_write_bytes(struct esp32p4_i2c_priv_s *priv,
                                   FAR const uint8_t *data, uint8_t len,
                                   bool ack_check, bool last)
{
  int ret;
  int i;

  if (len == 0)
    {
      return OK;
    }

  /* Reset FIFO before writing */

  esp32p4_i2c_reset_fifo(priv);

  /* Write data to TX FIFO */

  for (i = 0; i < len; i++)
    {
      REG_WRITE(priv->base + I2C_TXFIFO_MEM, data[i]);
    }

  /* Set up command 0: WRITE with ack_check */

  ret = esp32p4_i2c_write_cmd(priv, 0, I2C_CMD_OP_WRITE, len,
                              ack_check, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* Set up command 1: END */

  ret = esp32p4_i2c_write_cmd(priv, 1, I2C_CMD_OP_END, 0,
                              false, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* Start the transaction */

  REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_TRANS_START);

  /* Wait for command 0 to complete */

  ret = esp32p4_i2c_poll_cmd_done(priv, 0);
  if (ret < 0)
    {
      return ret;
    }

  /* Check for NACK if ack_check was enabled */

  if (ack_check &&
      (REG_READ(priv->base + I2C_SR_REG) & I2C_RESP_REC))
    {
      i2cerr("ERROR: I2C NACK received during write\n");
      return -EIO;
    }

  /* Wait for transaction complete if this is the last write */

  if (last)
    {
      ret = esp32p4_i2c_poll_trans_done(priv);
      if (ret < 0)
        {
          return ret;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: esp32p4_i2c_read_bytes
 *
 * Description:
 *   Execute the READ command and read bytes from the I2C RX FIFO.
 *
 ****************************************************************************/

static int esp32p4_i2c_read_bytes(struct esp32p4_i2c_priv_s *priv,
                                  FAR uint8_t *data, uint8_t len,
                                  bool send_nack)
{
  int ret;
  int i;
  uint32_t regval;

  if (len == 0)
    {
      return OK;
    }

  /* Reset FIFO before reading */

  esp32p4_i2c_reset_fifo(priv);

  /* Set up command 0: READ with NACK on last byte */

  ret = esp32p4_i2c_write_cmd(priv, 0, I2C_CMD_OP_READ, len,
                              false, false, send_nack);
  if (ret < 0)
    {
      return ret;
    }

  /* Set up command 1: END */

  ret = esp32p4_i2c_write_cmd(priv, 1, I2C_CMD_OP_END, 0,
                              false, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* Start the transaction */

  REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_TRANS_START);

