Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_i2c.c
  /* Wait for command 0 to complete */

  ret = esp32p4_i2c_poll_cmd_done(priv, 0);
  if (ret < 0)
    {
      return ret;
    }

  /* Wait for transaction complete */

  ret = esp32p4_i2c_poll_trans_done(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Read data from RX FIFO */

  for (i = 0; i < len; i++)
    {
      regval = REG_READ(priv->base + I2C_DATA_REG);
      data[i] = (uint8_t)(regval & 0xff);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32p4_i2c_do_write
 *
 * Description:
 *   Perform a complete I2C write transaction:
 *     START -> WRITE(addr+W) -> WRITE(data) -> STOP
 *
 ****************************************************************************/

static int esp32p4_i2c_do_write(struct esp32p4_i2c_priv_s *priv,
                                FAR struct i2c_msg_s *msg)
{
  int ret;
  uint8_t addr_byte;
  int remaining;
  int chunk;
  int offset = 0;
  bool nostop = (msg->flags & I2C_M_NOSTOP) != 0;

  /* Wait for bus to be idle */

  ret = esp32p4_i2c_wait_bus_idle(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Clear all pending interrupts */

  REG_WRITE(priv->base + I2C_INT_CLR_REG, 0x1ffff);

  /* Build address byte: 7-bit address + Write bit (0) */

  addr_byte = (uint8_t)(msg->addr << 1);

  /* Reset FIFO */

  esp32p4_i2c_reset_fifo(priv);

  /* Set up command sequence:
   *   CMD0: START
   *   CMD1: WRITE(addr byte, ack_check)
   *   CMD2: WRITE(data bytes, ack_check)
   *   CMD3: STOP (if not NOSTOP)
   *   CMD4: END
   */

  /* CMD0: START */

  ret = esp32p4_i2c_write_cmd(priv, 0, I2C_CMD_OP_RSTART, 0,
                              false, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* CMD1: WRITE address byte with ACK check */

  ret = esp32p4_i2c_write_cmd(priv, 1, I2C_CMD_OP_WRITE, 1,
                              true, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* Write address byte to FIFO */

  REG_WRITE(priv->base + I2C_TXFIFO_MEM, addr_byte);

  /* Write data bytes in chunks of up to I2C_FIFO_LEN */

  remaining = msg->length;
  while (remaining > 0)
    {
      chunk = (remaining > I2C_FIFO_LEN) ? I2C_FIFO_LEN : remaining;

      /* Reset FIFO for this chunk */

      if (offset > 0)
        {
          esp32p4_i2c_reset_fifo(priv);
        }

      /* Write data bytes to FIFO */

      {
        int i;
        for (i = 0; i < chunk; i++)
          {
            REG_WRITE(priv->base + I2C_TXFIFO_MEM,
                      msg->buffer[offset + i]);
          }
      }

      /* CMD2: WRITE data with ACK check */

      ret = esp32p4_i2c_write_cmd(priv, 2, I2C_CMD_OP_WRITE, chunk,
                                  true, false, false);
      if (ret < 0)
        {
          return ret;
        }

      /* CMD3: STOP (only on last chunk and if not NOSTOP) */

      if (remaining <= chunk && !nostop)
        {
          ret = esp32p4_i2c_write_cmd(priv, 3, I2C_CMD_OP_STOP, 0,
                                      false, false, false);
          if (ret < 0)
            {
              return ret;
            }
        }

      /* CMD4: END */

      ret = esp32p4_i2c_write_cmd(priv, 4, I2C_CMD_OP_END, 0,
                                  false, false, false);
      if (ret < 0)
        {
          return ret;
        }

      /* Start the transaction */

      REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_TRANS_START);

      /* Wait for CMD1 (address) to complete */

      ret = esp32p4_i2c_poll_cmd_done(priv, 1);
      if (ret < 0)
        {
          return ret;
        }

      /* Check for NACK on address */

      if (REG_READ(priv->base + I2C_SR_REG) & I2C_RESP_REC)
        {
          i2cerr("ERROR: I2C NACK on address 0x%02x\n", msg->addr);
          return -EIO;
        }

      /* Wait for CMD2 (data) to complete */

      ret = esp32p4_i2c_poll_cmd_done(priv, 2);
      if (ret < 0)
        {
          return ret;
        }

      /* Check for NACK on data */

      if (REG_READ(priv->base + I2C_SR_REG) & I2C_RESP_REC)
        {
          i2cerr("ERROR: I2C NACK on data\n");
          return -EIO;
        }

      /* Wait for transaction complete */

      ret = esp32p4_i2c_poll_trans_done(priv);
      if (ret < 0)
        {
          return ret;
        }

      offset += chunk;
      remaining -= chunk;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32p4_i2c_do_read
 *
 * Description:
 *   Perform a complete I2C read transaction:
 *     START -> WRITE(addr+R) -> READ(data) -> STOP
 *
 ****************************************************************************/

static int esp32p4_i2c_do_read(struct esp32p4_i2c_priv_s *priv,
                               FAR struct i2c_msg_s *msg)
{
  int ret;
  uint8_t addr_byte;
  int remaining;
  int chunk;
  int offset = 0;
  bool nostop = (msg->flags & I2C_M_NOSTOP) != 0;

  /* Wait for bus to be idle */

  ret = esp32p4_i2c_wait_bus_idle(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Clear all pending interrupts */

  REG_WRITE(priv->base + I2C_INT_CLR_REG, 0x1ffff);

  /* Build address byte: 7-bit address + Read bit (1) */

  addr_byte = (uint8_t)((msg->addr << 1) | 1);

  /* Reset FIFO */

  esp32p4_i2c_reset_fifo(priv);

  /* Set up command sequence:
   *   CMD0: START
   *   CMD1: WRITE(addr byte, ack_check)
   *   CMD2: READ(data bytes) with NACK on last byte
   *   CMD3: STOP (if not NOSTOP)
   *   CMD4: END
   */

  /* CMD0: START */

  ret = esp32p4_i2c_write_cmd(priv, 0, I2C_CMD_OP_RSTART, 0,
                              false, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* CMD1: WRITE address byte with ACK check */

  ret = esp32p4_i2c_write_cmd(priv, 1, I2C_CMD_OP_WRITE, 1,
                              true, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* Write address byte to FIFO */

  REG_WRITE(priv->base + I2C_TXFIFO_MEM, addr_byte);

  /* Read data in chunks of up to I2C_FIFO_LEN */

  remaining = msg->length;
  while (remaining > 0)
    {
      chunk = (remaining > I2C_FIFO_LEN) ? I2C_FIFO_LEN : remaining;

      /* Reset FIFO for this chunk */

      esp32p4_i2c_reset_fifo(priv);

      /* CMD2: READ data, NACK on last byte of last chunk */

