Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_i2c.c
      ret = esp32p4_i2c_write_cmd(priv, 2, I2C_CMD_OP_READ, chunk,
                                  false, false,
                                  (remaining <= chunk) ? true : false);
      if (ret < 0)
        {
          return ret;
        }

      /* CMD3: STOP (only on last chunk and if not NOSTOP) */

      if (remaining <= chunk && !nostop)
        {
          ret = esp32p4_i2c_write_cmd(priv, 3, I2C_CMD_OP_STOP, 0,
                                      false, false, false);
          if (ret < 0)
            {
              return ret;
            }
        }

      /* CMD4: END */

      ret = esp32p4_i2c_write_cmd(priv, 4, I2C_CMD_OP_END, 0,
                                  false, false, false);
      if (ret < 0)
        {
          return ret;
        }

      /* Start the transaction */

      REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_TRANS_START);

      /* Wait for CMD1 (address) to complete */

      ret = esp32p4_i2c_poll_cmd_done(priv, 1);
      if (ret < 0)
        {
          return ret;
        }

      /* Check for NACK on address */

      if (REG_READ(priv->base + I2C_SR_REG) & I2C_RESP_REC)
        {
          i2cerr("ERROR: I2C NACK on address 0x%02x\n", msg->addr);
          return -EIO;
        }

      /* Wait for CMD2 (data) to complete */

      ret = esp32p4_i2c_poll_cmd_done(priv, 2);
      if (ret < 0)
        {
          return ret;
        }

      /* Wait for transaction complete */

      ret = esp32p4_i2c_poll_trans_done(priv);
      if (ret < 0)
        {
          return ret;
        }

      /* Read data from RX FIFO */

      {
        int i;
        for (i = 0; i < chunk; i++)
          {
            msg->buffer[offset + i] =
              (uint8_t)(REG_READ(priv->base + I2C_DATA_REG) & 0xff);
          }
      }

      offset += chunk;
      remaining -= chunk;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32p4_i2c_do_writeread
 *
 * Description:
 *   Perform a combined write-then-read I2C transaction:
 *     START -> WRITE(addr+W) -> WRITE(reg_addr) ->
 *     RESTART -> WRITE(addr+R) -> READ(data) -> STOP
 *
 *   This is commonly used for reading registers from I2C devices.
 *
 ****************************************************************************/

static int esp32p4_i2c_do_writeread(struct esp32p4_i2c_priv_s *priv,
                                    FAR struct i2c_msg_s *wmsg,
                                    FAR struct i2c_msg_s *rmsg)
{
  int ret;
  uint8_t addr_byte;
  int i;
  int remaining;
  int chunk;
  int offset = 0;

  DEBUGASSERT(wmsg->length <= I2C_FIFO_LEN);

  /* Wait for bus to be idle */

  ret = esp32p4_i2c_wait_bus_idle(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Clear all pending interrupts */

  REG_WRITE(priv->base + I2C_INT_CLR_REG, 0x1ffff);

  /* Reset FIFO */

  esp32p4_i2c_reset_fifo(priv);

  /* Build write address byte: 7-bit address + Write bit (0) */

  addr_byte = (uint8_t)(wmsg->addr << 1);

  /* Set up command sequence:
   *   CMD0: START
   *   CMD1: WRITE(addr+W, ack_check)
   *   CMD2: WRITE(data, ack_check)
   *   CMD3: RESTART
   *   CMD4: WRITE(addr+R, ack_check)
   *   CMD5: READ(data) with NACK on last byte
   *   CMD6: STOP
   *   CMD7: END
   */

  /* CMD0: START */

  ret = esp32p4_i2c_write_cmd(priv, 0, I2C_CMD_OP_RSTART, 0,
                              false, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* CMD1: WRITE address byte with ACK check */

  ret = esp32p4_i2c_write_cmd(priv, 1, I2C_CMD_OP_WRITE, 1,
                              true, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* Write address byte to FIFO */

  REG_WRITE(priv->base + I2C_TXFIFO_MEM, addr_byte);

  /* Write register address/data bytes to FIFO */

  for (i = 0; i < wmsg->length; i++)
    {
      REG_WRITE(priv->base + I2C_TXFIFO_MEM, wmsg->buffer[i]);
    }

  /* CMD2: WRITE data bytes with ACK check */

  ret = esp32p4_i2c_write_cmd(priv, 2, I2C_CMD_OP_WRITE, wmsg->length,
                              true, false, false);
  if (ret < 0)
    {
      return ret;
    }

  /* Start transaction for write phase */

  REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_TRANS_START);

  /* Wait for CMD1 (address) to complete */

  ret = esp32p4_i2c_poll_cmd_done(priv, 1);
  if (ret < 0)
    {
      return ret;
    }

  /* Check for NACK on address */

  if (REG_READ(priv->base + I2C_SR_REG) & I2C_RESP_REC)
    {
      i2cerr("ERROR: I2C NACK on address 0x%02x\n", wmsg->addr);
      return -EIO;
    }

  /* Wait for CMD2 (data) to complete */

  ret = esp32p4_i2c_poll_cmd_done(priv, 2);
  if (ret < 0)
    {
      return ret;
    }

  /* Wait for write phase to complete */

  ret = esp32p4_i2c_poll_trans_done(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Now set up the read phase */

  /* Build read address byte: 7-bit address + Read bit (1) */

  addr_byte = (uint8_t)((rmsg->addr << 1) | 1);

  /* Read data in chunks of up to I2C_FIFO_LEN */

  remaining = rmsg->length;
  while (remaining > 0)
    {
      chunk = (remaining > I2C_FIFO_LEN) ? I2C_FIFO_LEN : remaining;

      /* Reset FIFO */

      esp32p4_i2c_reset_fifo(priv);

      /* CMD0: RESTART */

      ret = esp32p4_i2c_write_cmd(priv, 0, I2C_CMD_OP_RSTART, 0,
                                  false, false, false);
      if (ret < 0)
        {
          return ret;
        }

      /* CMD1: WRITE address byte with ACK check */

      ret = esp32p4_i2c_write_cmd(priv, 1, I2C_CMD_OP_WRITE, 1,
                                  true, false, false);
      if (ret < 0)
        {
          return ret;
        }

      /* Write address byte to FIFO */

      REG_WRITE(priv->base + I2C_TXFIFO_MEM, addr_byte);

      /* CMD2: READ data, NACK on last byte */

      ret = esp32p4_i2c_write_cmd(priv, 2, I2C_CMD_OP_READ, chunk,
                                  false, false,
                                  (remaining <= chunk) ? true : false);
      if (ret < 0)
        {
          return ret;
        }

      /* CMD3: STOP on last chunk */

      if (remaining <= chunk)
        {
          ret = esp32p4_i2c_write_cmd(priv, 3, I2C_CMD_OP_STOP, 0,
                                      false, false, false);
          if (ret < 0)
            {
              return ret;
            }
        }

      /* CMD4: END */

      ret = esp32p4_i2c_write_cmd(priv, 4, I2C_CMD_OP_END, 0,
                                  false, false, false);
      if (ret < 0)
        {
          return ret;
        }

      /* Start the read transaction */

      REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_TRANS_START);

      /* Wait for CMD1 (address) to complete */

      ret = esp32p4_i2c_poll_cmd_done(priv, 1);
      if (ret < 0)
        {
          return ret;
        }

      /* Check for NACK on address */

      if (REG_READ(priv->base + I2C_SR_REG) & I2C_RESP_REC)
        {
          i2cerr("ERROR: I2C NACK on read address 0x%02x\n", rmsg->addr);
          return -EIO;
        }

      /* Wait for CMD2 (data) to complete */

      ret = esp32p4_i2c_poll_cmd_done(priv, 2);
      if (ret < 0)
        {
          return ret;
        }

      /* Wait for transaction complete */

