Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_i2c.c
      ret = esp32p4_i2c_poll_trans_done(priv);
      if (ret < 0)
        {
          return ret;
        }

      /* Read data from RX FIFO */

      for (i = 0; i < chunk; i++)
        {
          rmsg->buffer[offset + i] =
            (uint8_t)(REG_READ(priv->base + I2C_DATA_REG) & 0xff);
        }

      offset += chunk;
      remaining -= chunk;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32p4_i2c_transfer
 *
 * Description:
 *   Perform a sequence of I2C transfers.
 *
 *   This is the main entry point for I2C transfers.  It handles:
 *   - Single write messages
 *   - Single read messages
 *   - Combined write-then-read messages (register read pattern)
 *
 ****************************************************************************/

static int esp32p4_i2c_transfer(FAR struct i2c_master_s *dev,
                                FAR struct i2c_msg_s *msgs, int count)
{
  FAR struct esp32p4_i2c_priv_s *priv = (FAR struct esp32p4_i2c_priv_s *)dev;
  int ret;
  int i;

  DEBUGASSERT(dev != NULL && msgs != NULL && count > 0);

  /* Acquire the bus mutex */

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Process messages */

  for (i = 0; i < count; i++)
    {
      FAR struct i2c_msg_s *msg = &msgs[i];

      /* Check for combined write-then-read pattern:
       * - Current message is a write (not I2C_M_READ)
       * - Next message exists and is a read
       * - Same address
       * - Current message has I2C_M_NOSTOP set
       */

      if (i < count - 1 &&
          !(msg->flags & I2C_M_READ) &&
          (msgs[i + 1].flags & I2C_M_READ) &&
          msg->addr == msgs[i + 1].addr)
        {
          /* Combined write-then-read */

          ret = esp32p4_i2c_do_writeread(priv, msg, &msgs[i + 1]);
          i++;  /* Skip the read message */
        }
      else if (msg->flags & I2C_M_READ)
        {
          /* Read transaction */

          ret = esp32p4_i2c_do_read(priv, msg);
        }
      else
        {
          /* Write transaction */

          ret = esp32p4_i2c_do_write(priv, msg);
        }

      if (ret < 0)
        {
          goto errout;
        }
    }

errout:
  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_i2c_reset
 *
 * Description:
 *   Perform an I2C bus reset to recover from stuck devices.
 *
 *   This resets the I2C controller state machine and reconfigures
 *   the clock.
 *
 ****************************************************************************/

static int esp32p4_i2c_reset(FAR struct i2c_master_s *dev)
{
  FAR struct esp32p4_i2c_priv_s *priv = (FAR struct esp32p4_i2c_priv_s *)dev;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Reset the I2C controller */

  REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_FSM_RST);

  /* Reconfigure clock */

  esp32p4_i2c_set_clock(priv, priv->freq);

  /* Reconfigure GPIO */

  esp32p4_i2c_config_gpio(priv);

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_i2c_setup
 *
 * Description:
 *   Initialize the I2C controller.
 *
 *   This is called when the I2C device is first opened.  It configures
 *   the GPIO pins, sets the clock frequency, and enables master mode.
 *
 ****************************************************************************/

static int esp32p4_i2c_setup(FAR struct i2c_master_s *dev)
{
  FAR struct esp32p4_i2c_priv_s *priv = (FAR struct esp32p4_i2c_priv_s *)dev;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Increment reference count */

  priv->refs++;
  if (priv->refs > 1)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  /* Configure GPIO pins for I2C */

  esp32p4_i2c_config_gpio(priv);

  /* Enable master mode, clock enable, and arbitration */

  REG_WRITE(priv->base + I2C_CTR_REG,
            I2C_MS_MODE |          /* Master mode */
            I2C_CLK_EN |           /* Clock enable */
            I2C_ARBITRATION_EN);   /* Arbitration enable */

  /* Configure FIFO */

  REG_WRITE(priv->base + I2C_FIFO_CONF_REG,
            I2C_NONFIFO_EN |       /* Non-FIFO mode */
            I2C_FIFO_PRT_EN);      /* FIFO protection */

  /* Set clock frequency */

  esp32p4_i2c_set_clock(priv, priv->freq);

  /* Clear all pending interrupts */

  REG_WRITE(priv->base + I2C_INT_CLR_REG, 0x1ffff);

  /* Disable all interrupts (polling mode) */

  REG_WRITE(priv->base + I2C_INT_ENA_REG, 0);

  /* Update configuration */

  REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_CONF_UPGATE);

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_i2c_shutdown
 *
 * Description:
 *   Shut down the I2C controller.
 *
 *   This is called when the I2C device is closed.  It disables the
 *   I2C controller and releases resources.
 *
 ****************************************************************************/

static int esp32p4_i2c_shutdown(FAR struct i2c_master_s *dev)
{
  FAR struct esp32p4_i2c_priv_s *priv = (FAR struct esp32p4_i2c_priv_s *)dev;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Decrement reference count */

  priv->refs--;
  if (priv->refs > 0)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  /* Disable all interrupts */

  REG_WRITE(priv->base + I2C_INT_ENA_REG, 0);

  /* Clear all pending interrupts */

  REG_WRITE(priv->base + I2C_INT_CLR_REG, 0x1ffff);

  /* Reset the I2C controller */

  REG_SET_BIT(priv->base + I2C_CTR_REG, I2C_FSM_RST);

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_i2cbus_register
 *
 * Description:
 *   Register an I2C bus driver for the specified I2C port.
 *
 *   This function initializes the I2C controller hardware and registers
 *   the I2C character device at /dev/i2cN.
 *
 * Input Parameters:
 *   port - I2C port number (0 for I2C0, 1 for I2C1)
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.
 *
 ****************************************************************************/

int esp32p4_i2cbus_register(int port)
{
  FAR struct esp32p4_i2c_priv_s *priv;
  int ret;

  switch (port)
    {
#ifdef CONFIG_ESP32P4_I2C0
      case 0:
        priv = &g_i2c0_priv;
        break;
#endif

#ifdef CONFIG_ESP32P4_I2C1
      case 1:
        priv = &g_i2c1_priv;
        break;
#endif

      default:
        i2cerr("ERROR: Invalid I2C port: %d\n", port);
        return -EINVAL;
    }

  /* Register the I2C character device */

  ret = i2c_register((FAR struct i2c_master_s *)priv, port);
  if (ret < 0)
    {
      i2cerr("ERROR: Failed to register I2C%d: %d\n", port, ret);
      return ret;
    }

  i2cinfo("I2C%d registered successfully\n", port);
  return OK;
}
